@clong Absolutely!! Sometime next week sounds great if your schedule permits.

_How much RAM does your NUC have?_ :: **32GB**
_When you start the terraform build process, what does your ESXi console show in the recent tasks pane?_ ::  It would show that It was creating the same host  4 times.. like 4 instances of the same host. That was before I decided to start creating them individually like you had suggested.

_Which VMs do you mean? You want to destroy and recreate the logger, dc, wef, and win10 hosts....._
I created the logger host and when I was about to start with the dc I noticed the terraform plan listed the already created logger host for deletion.. see the logs:

Terraform will perform the following actions:

  # esxi_guest.dc will be created
  + resource "esxi_guest" "dc" {
      + boot_disk_size         = (known after apply)
      + boot_disk_type         = "thin"
      + clone_from_vm          = "WindowsServer2016"
      + disk_store             = "datastore2"
      + guest_name             = "dc"
      + guest_shutdown_timeout = 30
      + guest_startup_timeout  = 45
      + guestos                = "windows9srv-64"
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + memsize                = "4096"
      + notes                  = (known after apply)
      + numvcpus               = "2"
      + ovf_properties_timer   = (known after apply)
      + power                  = "on"
      + resource_pool_name     = "/"
      + virthwver              = (known after apply)

      + network_interfaces {
          + mac_address     = "00:50:56:a1:b1:c2"
          + nic_type        = "e1000"
          + virtual_network = "VM Network"
        }
      + network_interfaces {
          + mac_address     = "00:50:56:a1:b1:c4"
          + nic_type        = "e1000"
          + virtual_network = "HostOnly Network"
        }
    }

  # esxi_guest.logger will be destroyed
  - resource "esxi_guest" "logger" {
      - boot_disk_type         = "thin" -> null
      - clone_from_vm          = "Ubuntu1804" -> null
      - disk_store             = "datastore2" -> null
      - guest_name             = "logger" -> null
      - guest_shutdown_timeout = 30 -> null
      - guest_startup_timeout  = 45 -> null
      - guestos                = "ubuntu-64" -> null
      - id                     = "9" -> null
      - ip_address             = "Logger_IP" -> null
      - memsize                = "4096" -> null
      - numvcpus               = "2" -> null
      - ovf_properties_timer   = 0 -> null
      - power                  = "on" -> null
      - resource_pool_name     = "/" -> null
      - virthwver              = "9" -> null

      - network_interfaces {
          - mac_address     = "00:50:56:a3:b1:c2" -> null
          - nic_type        = "e1000" -> null
          - virtual_network = "VM Network" -> null
        }
      - network_interfaces {
          - mac_address     = "00:50:56:a3:b1:c4" -> null
          - nic_type        = "e1000" -> null
          - virtual_network = "HostOnly Network" -> null

**Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + dc_interfaces     = [
      + {
          + mac_address     = "00:50:56:a1:b1:c2"
          + nic_type        = "e1000"
          + virtual_network = "VM Network"
        },
      + {
          + mac_address     = "00:50:56:a1:b1:c4"
          + nic_type        = "e1000"
          + virtual_network = "HostOnly Network"
        },
    ]
  + dc_ips            = (known after apply)
  - logger_interfaces = [
      - {
          - mac_address     = "00:50:56:a3:b1:c2"
          - nic_type        = "e1000"
          - virtual_network = "VM Network"
        },
      - {
          - mac_address     = "00:50:56:a3:b1:c4"
          - nic_type        = "e1000"
          - virtual_network = "HostOnly Network"
        },
    ] -> null
  - logger_ips        = "logger_IP" -> null**

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

